## 1. 판다스(Pandas)
### 0) 필요패키지 임포트

In [1]:
import pandas as pd
import numpy as np

### 1) 데이터프레임(DataFrame)
- 2차원 리스트를 매개변수로 전달하는 구조
- 2차원이므로 행방향 인덱스(index)와 열방향 인덱스(column)가 존재
- 데이터프레임은 열(columns)까지 추가되어 열(columns), 인덱스(index), 값(values)으로 구성
- 시리즈는 인덱스(index)와 값(values)으로 구성

In [15]:
values = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
index = ['one', 'two', 'three']
columns = ['A', 'B', 'C']

df = pd.DataFrame(values, index=index, columns=columns)


print(df)

       A  B  C
one    1  2  3
two    4  5  6
three  7  8  9

In [13]:
values = [[1,2,3], [4,5,6], [7,8,9]]

df1 = pd.DataFrame(values)
# index와 columns를 지정하지 않으면 기본값(0부터 1씩증가하는 정수)으로 출력된다.

print(df1)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [17]:
# index는 타입(dtype)도 함께 출력됨
print(df.index)
print(df.columns)
print(df.values)

Index(['one', 'two', 'three'], dtype='object')
Index(['A', 'B', 'C'], dtype='object')
[[1 2 3]
 [4 5 6]
 [7 8 9]]

#### 1-1) 데이터프레임의 생성

테이터 프레임 생성이 가능한 경우 
1. 리스트
2. 시리즈
3. 딕셔너리
4. Numpy의 ndarrays

In [24]:
# 리스트로 생성하기
data = [
    ['1000', 'Steve', 90.72], 
    ['1001', 'James', 78.09], 
    ['1002', 'Doyeon', 98.43], 
    ['1003', 'Jane', 64.19], 
    ['1004', 'Pilwoong', 81.30],
    ['1005', 'Tony', 99.14],
]

df = pd.DataFrame(data)
print(df)
type(df)

print()

#열(columns) 지정
df = pd.DataFrame(data, columns=['학번', '이름', '점수'])
print(df)

      0         1      2
0  1000     Steve  90.72
1  1001     James  78.09
2  1002    Doyeon  98.43
3  1003      Jane  64.19
4  1004  Pilwoong  81.30
5  1005      Tony  99.14

     학번        이름     점수
0  1000     Steve  90.72
1  1001     James  78.09
2  1002    Doyeon  98.43
3  1003      Jane  64.19
4  1004  Pilwoong  81.30
5  1005      Tony  99.14

In [32]:
# 딕셔너리로 생성하기
# 딕셔너리에서는 key가 열값이 됨

data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)

In [30]:
print(df)

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [28]:
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

주피터 노트에서 print(df)와 단순히 df를 사용할 때의 차이

1). df
주피터 노트북에서 셀에 df를 입력하고 셀을 실행하면,
df 데이터프레임의 테이블 형태의 시각적 표현이 셀 아래에 표시됨

-> 주피터 노트북이 df의 내용을 HTML 테이블 형식으로 렌더링하여 보여주기 때문
    ->> 더 읽기 쉽고, 스타일이 적용된 형식으로 제공

2). print(df)
print(df)를 사용하면 데이터프레임의 내용을 텍스트 형식으로 출력합니다.
콘솔에 텍스트 기반의 데이터프레임이 출력

-> 표가 아닌 문자열로 표시되며, 시각적으로는 덜 정교하게 보일 수 있음

In [38]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [40]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [42]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [46]:
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [48]:
#전치 가능
df.T

                    서울       부산       인천       대구
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

#### 1-2) 열 데이터의 갱신, 추가, 삭제
- 데이터프레임은 열 시리즈의 딕셔너리으로 볼 수 있으므로 열 단위로 데이터를 갱신하거나 추가, 삭제할 수 있음

In [76]:
# 딕셔너리로 생성하기
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
# columns에서 설정한 순서대로 dataFrame에 들어가고 설정된다.
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [57]:
# "2010-2015 증가율"이라는 열의 값 변경

df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
#대입을 해줘야 df에 적용된다.
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [59]:
# 새로운 열 추가

df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(3)
# "2005-2010 증가율"이라는 이름의 열 추가

df

     지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83         -1.343
부산  경상권  3448737  3393191  3512547  3655437           1.63         -3.398
인천  수도권  2890451  2632035  2517680  2466338           9.82          4.542
대구  경상권  2466052  2431774  2456016  2473990           1.41         -0.987

In [61]:
# "2005-2010 증가율"이라는 이름의 열 삭제
del df["2005-2010 증가율"]
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

#### 1-3) 열 인덱싱
- 데이터프레임은 열 라벨을 키로, 열 시리즈를 값으로 가지는 딕셔너리와 비슷함
- 데이터프레임을 인덱싱을 할 때도 열 라벨(column label)을 키값으로 생각하여 인덱싱 가능

In [93]:
# 하나의 열만 인덱싱하면 시리즈가 반환된다.
# 딕셔너리로 생성하기
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
# columns에서 설정한 순서대로 dataFrame에 들어가고 설정된다.
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)

df["지역"]

서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [68]:
# 여러개의 열을 인덱싱하면 부분적인 데이터프레임이 반환된다.
df[["2010", "2015"]]

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [70]:
# 2010이라는 열을 반환하면서 데이터프레임 자료형을 유지
df[["2010"]]

       2010
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [72]:
type(df[["2010"]])

pandas.core.frame.DataFrame

In [74]:
# 2010이라는 열을 반환하면서 시리즈 자료형으로 변환
df["2010"]

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [78]:
type(df["2010"])

pandas.core.series.Series

In [82]:
# 문자열 라벨을 가지는 경우 정수 인덱스를 열 인덱싱에 사용할 수 없음
# 열 명이 숫자로 정의된 경우는 가능하지만, 문자열을 준다면 불가능
# 문자로 지정되어 있을 때는 정확히 입력해야한다

df[0]

KeyError: 0

In [86]:
# 열 인덱스가 정수형일땐 인덱스 값에 정수 사용 가능
df2 = pd.DataFrame(np.arange(12).reshape(3, 4))
print(df2)
print()

print(df2[2])

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

0     2
1     6
2    10
Name: 2, dtype: int32

In [95]:
df2[[1, 2]]

SyntaxError: invalid syntax (1664820039.py, line 1)

#### 1-4) 행 인덱싱
- 행 단위로 인덱싱을 하고자 하면 항상 슬라이싱(slicing) 사용
- 인덱스의 값이 문자 라벨이면 라벨 슬라이싱도 가능

In [97]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
# columns에서 설정한 순서대로 dataFrame에 들어가고 설정된다.
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)

df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [104]:
df[1:3]

#1행부터 2(3-1)행까지 출력

     지역     2015     2010     2005     2000  2010-2015 증가율
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982

In [106]:
df["서울":"인천"]

#문자열로 인덱싱하면 m까지 출력

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982

In [132]:
# 개별 데이터 인덱싱 / 열 라벨로 인덱싱 후 행 라벨로 인덱싱하면 원하는 개별 데이터 추출
df[["2010","2000"]]["인천":"대구"]

       2010     2000
인천  2632035  2466338
대구  2431774  2473990

### #2 연습문제 
다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

1. 모든 학생의 수학 점수를 시리즈로 나타낸다.
2. 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
3. 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
4. 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
5. 춘향의 점수를 데이터프레임으로 나타낸다.
6. 향단의 점수를 시리즈로 나타낸다.

In [21]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [22]:
# 1. 모든 학생의 수학 점수를 시리즈로 나타낸다.
# 하나의 열만 인덱싱하면 시리즈가 반환된다.

df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [24]:
# 2. 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
# 여러개의 열을 인덱싱하면 부분적인 데이터프레임이 반환된다.

df[["국어", "영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [7]:
# 3-1. 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

df["평균 점수"] = ((df["국어"]+df["영어"]+df["수학"])/3).round(2)
df

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [23]:
# 3-2. 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

df["평균 점수"] = round(df.mean(axis=1), 2)
# axis =1 : 행을 기준으로 연산 수행
# axis =0 : 열을 기준으로 연산 수행
# df.mean(axis=1)은 각 행을 기준으로 평균값을 자동으로 계산

df

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [37]:
# 4. 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

df.loc["방자","영어"] = 80
# df["평균 점수"] = ((df["국어"]+df["영어"]+df["수학"])/3).round(2)
df["평균 점수"] = df.mean(axis=1).round(2)
# round의 영향때문(으로 추정) -> 돌릴 때마다 값이 변한다.
# df["평균 점수"] = df.drop(columns=["평균 점수"], errors='ignore').mean(axis=1).round(2)

df

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [34]:
# 5. 춘향의 점수를 데이터프레임으로 나타낸다.
df[:1]

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67

In [55]:
# 6-1. 향단의 점수를 시리즈로 나타낸다.

pd.Series(list(df[2:3].values),index=["향단"])

향단    [70.0, 60.0, 80.0, 70.0]
dtype: object

In [40]:
# 6-2. 향단의 점수를 시리즈로 나타낸다.

df2 = (df.T)
df2["향단"]

국어       70.0
영어       60.0
수학       80.0
평균 점수    70.0
Name: 향단, dtype: float64

In [51]:
# 행을 추가하는 방법
subject_mean = round(df.mean(axis=0),2)
subject_mean = pd.DataFrame([subject_mean], index=["평균"]) 


# '방자' 아래에 '과목별 평균' 행 추가
df = pd.concat([df, subject_mean])
# '과목별 평균'을 '방자' 아래에 배치
# df = df.reindex(index=["춘향", "몽룡", "향단", "방자", "평균"])
df = df.loc[["춘향", "몽룡", "향단", "방자", "평균"]]

df

      국어    영어    수학  평균 점수
춘향  80.0  90.0  90.0  86.67
몽룡  90.0  70.0  60.0  73.33
향단  70.0  60.0  80.0  70.00
방자  30.0  80.0  70.0  60.00
평균  67.5  75.0  75.0  72.50

In [12]:
del df["평균 점수"]     # 열을 지우는 명령어
# df= df.drop("평균")     # 행을 지우는 명령어
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  80  70

### 2) 데이터프레임 조회하기
- df.head(n) - 앞 부분을 n개만 보기
- df.tail(n) - 뒷 부분을 n개만 보기
- df['열이름'] - 해당되는 열을 확인

In [41]:
# 앞 부분을 3개만 보기
print(df.head(3))

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00

### 3) 데이터프레임 고급 인덱싱
- loc : 라벨값 기반의 2차원 인덱싱<br>
- iloc : 순서를 나타내는 정수 기반의 2차원 인덱싱

#### 3-1) loc 인덱서
- df.loc[행 인덱싱값]
- df.loc[행 인덱싱값, 열 인덱싱값]

In [3]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [5]:
# 인덱싱값을 하나만 받는 경우

# loc 인덱서를 사용하면서 인덱스를 하나만 넣으면 행(row)을 선택
# 행 인덱싱은 원래 무조건 : 슬라이싱 했어야 했는데, loc를 사용함으로서 슬라이싱을 하지 않아도 동작 가능

df.loc["a"]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [7]:
# 슬라이스도 가능
# 이 경우는 loc가 없는 것과 있는 것과 큰 차이가 없다(서로 같다.)
df.loc["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [9]:
# 이 때에는 loc를 쓰지 않는 경우와 같음
df["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [12]:
dft = pd.DataFrame(np.arange(10, 22).reshape(3, 4))
dft

    0   1   2   3
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21

In [22]:
dft.loc[:2]

    0   1   2   3
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21

In [30]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4, 4), columns=["A", "B", "C", "D"])
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [32]:
# 슬라이스의 마지막 값 포함
df2.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [26]:
# if문을 사용하는 것과 같은 효과를 시리즈로 출력

"""
df.A > 15는 if문처럼 단일 조건을 평가하는 것이 아니라,
A 열의 모든 요소에 대해 벡터화된 비교를 수행하여 불리언 시리즈를 생성.
이 결과를 이용하여 데이터 필터링, 조건에 따른 연산 등을 효율적으로 수행할 수 있음
"""

df.A > 15

a    False
b    False
c     True
Name: A, dtype: bool

In [28]:
df.loc[df.A > 15]

    A   B   C   D
c  18  19  20  21

#### 인덱싱값을 행과 열 모두 받는 경우
- df.loc[행 인덱스, 열 인덱스]와 같은 형태로 사용

In [34]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [45]:
# 행 인덱스 라벨값이 a, 열 인덱스 라벨값이 A인 위치의 값을 구하기
df.loc["a", "A"]

10

In [47]:
# 범위를 지정하여 시리즈 형태로 출력하기
print(df.loc["b":, "A"])
print()
print(df.loc["a", :])

b    14
c    18
Name: A, dtype: int32

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [51]:
#범위를 지정하여 데이터 프레임 형태로 출력하기

df.loc[["a", "b"], ["B", "D"]]

    B   D
a  11  13
b  15  17

In [54]:
# A열의 값이 10보다 큰 행을 선택하고, "C", "D" 열의 값을 출력한다.
df.loc[df.A > 10, ["C", "D"]]

    C   D
b  16  17
c  20  21

#### 3-2) iloc 인덱서
- iloc 인덱서는 loc 인덱서와 반대로 라벨이 아니라 순서를 나타내는 정수(integer) 인덱스만 받음

In [56]:
df = pd.DataFrame(np.arange(10, 22, 1).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [60]:
#숫자로 찾느냐, 문자열로 찾느냐

print(df.iloc[0, 1])
print()
print(df.iloc[:2, 2])

11

a    12
b    16
Name: C, dtype: int32

In [65]:
# 0행, -2번째열 부터 마지막 열까지
df.iloc[0, -2:]

C    12
D    13
Name: a, dtype: int32

In [69]:
# 2행, 1열부터 2행까지
df.iloc[2:3, 1:3]

    B   C
c  19  20

In [71]:
# loc 인덱서와 마찬가지로 인덱스가 하나만 들어가면 행을 선택
df.iloc[-1]

A    18
B    19
C    20
D    21
Name: c, dtype: int32

#### 슬라이싱

1. 시리즈 -> n:m => n부터 m까지(m포함)
2. 데이터프레임에서 열 인덱싱 -> n:m => 사용 불가능
3. 데이터프레임에서 행 인덱싱 -> n:m => n부터 m-1까지(m 비포함)
   - 단, 문자열로 행 인덱싱을 하면 m까지 출력(m포함)
   - 예시 : df["서울":"인천"]
   - loc를 사용하면 행 인덱싱을 n:m => n부터 m까지(m포함)
   - iloc를 사용하면 행 인덱싱을 n:m => n부터 m-1까지(m 비포함)

### #2 연습문제
1. 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
2. 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

### 4. 데이터프레임의 데이터 조작
#### 4-1) 데이터 갯수 세기

In [84]:
# 0부터 9까지의 값을 갖는 Series 생성
s = pd.Series(range(10))

# s[3]을 NaN값으로 변경
s[3] = np.nan
# NaN은 int 형식으로 표현이 불가능해서, Series 값이 전부 float 형태로 바뀐다.
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [86]:
# NaN 값은 세지 않음
s.count()

9

In [88]:
np.random.seed(2)
#random.seed를 사용하면서 예상가능한 난수를 사용한다.

df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
#np.random.randint 0에서 5사이의 flaot형태의 값을 가지는 4*4 배열 생성

df.iloc[2, 3] = np.nan
#[2,3]의 위치의 값을 NaN으로 변경

df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [92]:
# 각 열의 NaN 값이 아닌 값의 수를 반환
# 출력 형태가 행 단위로 출력되는 것 처럼 보여서 헷갈릴 수 있음
df.count()

0    4
1    4
2    4
3    3
dtype: int64

#### 4-2) 카테고리 값 세기
- 시리즈의 값이 정수, 문자열, 카테고리 값인 경우에는 value_counts 메서드로 각각의 값이 나온 횟수를 셀 수 있음

In [98]:
np.random.seed(1)

# 0부터 5까지의 값을 무작위로 100개 생성
# 이것을 Pandas Series로 변경
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int32

In [122]:
# 값에 의해 내림차순으로 정렬
print(s2.value_counts())

print()
# 인덱스에 따라 값을 정렬
print(s2.value_counts().sort_index())

1    22
0    18
4    17
5    16
3    14
2    13
Name: count, dtype: int64

0    18
1    22
2    13
3    14
4    17
5    16
Name: count, dtype: int64

In [138]:
np.random.seed(2)
#random.seed를 사용하면서 예상가능한 난수를 사용한다.

df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
#np.random.randint 0에서 5사이의 flaot형태의 값을 가지는 4*4 배열 생성

df.iloc[2, 3] = np.nan
#[2,3]의 위치의 값을 NaN으로 변경

df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [109]:
df.value_counts()

0    1    2    3
0.0  0.0  3.0  2.0    1
3.0  0.0  2.0  1.0    1
4.0  3.0  4.0  2.0    1
Name: count, dtype: int64

In [119]:
for i in range(4):
    print(df[i].value_counts().sort_index())
    print()

0
0.0    1
3.0    2
4.0    1
Name: count, dtype: int64

1
0.0    2
2.0    1
3.0    1
Name: count, dtype: int64

2
2.0    1
3.0    1
4.0    2
Name: count, dtype: int64

3
1.0    1
2.0    2
Name: count, dtype: int64

#### 4-3) 정렬
- s2 시리즈의 각 데이터 값에 따른 데이터 갯수를 인덱스에 따라 정렬

In [136]:
s = pd.Series(range(10))

# s[3]을 NaN값으로 변경
s[3] = np.nan
s

# 값에 의해 오름차순으로 정렬
print(s.sort_values())

print()
# 반대(내림차순, 큰수에서 작은 수로)로 정렬하고 싶을 때
print(s.sort_values(ascending=False))

# 값에 의한 정렬시 오름차순 내림차순 상관 없이 NaN 값은 가장 나중에 나온다

print()
# 인덱스에 따라 값을 정렬
print(s.sort_index())

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [140]:
np.random.seed(2)
#random.seed를 사용하면서 예상가능한 난수를 사용한다.

df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
#np.random.randint 0에서 5사이의 flaot형태의 값을 가지는 4*4 배열 생성

df.iloc[2, 3] = np.nan
#[2,3]의 위치의 값을 NaN으로 변경

df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [146]:
# by 인수로 정렬 기준이 되는 열을 지정
df.sort_values(by=2)

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [158]:
# by 인수에 리스트 값을 넣으면 이 순서대로 정렬 기준의 우선 순위가 정해짐
# 리스트의 첫번째 열을 기준으로 정렬한 후 동일한 값이 나오면 그 다음 열로 순서를 따짐

df.sort_values(by=[1,0])

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

#### 4-4) 행/열 합계
- 행과 열의 합계를 구할 때는 sum(axis) 메서드를 사용한다.
- axis 인수에는 합계로 인해 없어지는 방향축(0=행, 1=열)을 지정
- 행방향 합계를 구할 때는 sum(axis=1) 메서드를 사용
- 열방향 합계를 구할 때는 sum(axis=0) 메서드를 사용

In [162]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [164]:
df2.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

In [166]:
df2["RowSum"] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [168]:
# 열 합계를 구할 때는 sum(axis=0), 디폴트 값이므로 생략 가능
df2.sum()

0          24
1          33
2          25
3          24
4          15
5          10
6           5
7          16
RowSum    152
dtype: int64

#### 4-5) apply 변환
인수로 행 또는 열을 받는 함수를 apply 메서드의 인수로 넣으면 각 열(또는 행)을 반복하여 그 함수에 적용시킴

In [171]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [173]:
#각 열의 최대값과 최소값의 차이를 출력
#결과는 시리즈의 형태로 반환된다.
df3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [175]:
#axis =1 을 함으로서 행 함수를 적용한다.(디폴트는 0이고 열의 연산이다)
df3.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [177]:
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

#### 4-6) fillna 메서드

In [190]:
np.random.seed(2)
#random.seed를 사용하면서 예상가능한 난수를 사용한다.

df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
#np.random.randint 0에서 5사이의 flaot형태의 값을 가지는 4*4 배열 생성

df.iloc[2, 3] = np.nan
#[2,3]의 위치의 값을 NaN으로 변경

df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [198]:
df.apply(pd.value_counts).fillna(0.0)

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_2212\2185269511.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  df.apply(pd.value_counts).fillna(0.0)

       0    1    2    3
0.0  1.0  2.0  0.0  0.0
1.0  0.0  0.0  0.0  1.0
2.0  0.0  1.0  1.0  2.0
3.0  2.0  1.0  1.0  0.0
4.0  1.0  0.0  2.0  0.0

In [200]:
result = df.apply(lambda x: pd.Series(x).value_counts()).fillna(0.0)
result

       0    1    2    3
0.0  1.0  2.0  0.0  0.0
1.0  0.0  0.0  0.0  1.0
2.0  0.0  1.0  1.0  2.0
3.0  2.0  1.0  1.0  0.0
4.0  1.0  0.0  2.0  0.0

#### 4-7) astype 메서드
astype 메서드로 전체 데이터의 자료형을 바꾸는 것도 가능

In [203]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [205]:
df3.apply(pd.value_counts)

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_2212\3610007328.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [211]:
result = df3.apply(lambda x: pd.Series(x).value_counts())
result

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [223]:
#각 열의 값에 대한 빈도수 반환. 이 때, .fillna(0)으로 NaN 값을 처리해 주지 않으면 오류가 발생한다. 
df3.apply(pd.value_counts).fillna(0).astype(int)

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_2212\3950692763.py:2: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [225]:
#각 열의 값에 대한 빈도수 반환. 이 때, .fillna(0)으로 NaN 값을 처리해 주지 않으면 오류가 발생한다. 
result = df3.apply(lambda x: pd.Series(x).value_counts()).fillna(0).astype(int)
result

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

#### 4-8) 실수 값을 카테고리 값으로 변환
- cut: 실수 값의 경계선을 지정하는 경우
- qcut: 갯수가 똑같은 구간으로 나누는 경우

In [232]:
# 나이 데이터 리스트
ages = [3, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 99]

# 나이 구간을 정의하는 bins 리스트
# 각 구간의 경계값을 설정
bins = [1, 20, 30, 50, 70, 100]

# 각 구간에 대한 레이블을 정의
# bins의 각 구간에 맞는 레이블을 설정
labels = ["미성년자", "청년", "중년", "장년", "노년"]

# pd.cut을 사용하여 나이를 범주형 데이터로 변환
# ages 리스트의 각 값이 bins 리스트의 구간에 따라 레이블로 변환됨
cats = pd.cut(ages, bins, labels=labels)

# 변환된 범주형 데이터를 출력
cats

['미성년자', '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', '노년']
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [234]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [236]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [238]:
ages

[3, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 99]

In [242]:
cats.codes

# cats 범주형 데이터의 각 범주에 대한 정수형 코드를 반환
# 범주형 데이터의 범주가 0부터 시작하는 정수로 매핑되어 codes 속성에 저장됩니다
# 0은 "미성년자", 1은 "청년", 2는 "중년", 3은 "장년", 4는 "노년"

array([0, 0, 0, 1, 1, 2, 2, 3, 0, 2, 2, 4], dtype=int8)

In [244]:
df4 = pd.DataFrame(ages, columns=["ages"])
df4["age_cat"] = pd.cut(df4.ages, bins, labels=labels)
df4

    ages age_cat
0      3    미성년자
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      중년
6     31      중년
7     61      장년
8     20    미성년자
9     41      중년
10    32      중년
11    99      노년

In [246]:
# age_cat 열값을 astype 메서드 사용해서 문자열로 바꾸기
df4.age_cat.astype(str) + df4.ages.astype(str)

0      미성년자3
1      미성년자2
2     미성년자10
3       청년21
4       청년23
5       중년37
6       중년31
7       장년61
8     미성년자20
9       중년41
10      중년32
11      노년99
dtype: object

qcut 명령은 구간 경계선을 지정하지 않고 데이터 갯수가 같도록 지정한 수의 구간으로 나눔

예를 들어 다음 코드는 1000개의 데이터를 4개의 구간으로 나누는데 각 구간은 250개씩의 데이터를 가짐

In [266]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
# 나눌 데이터가 들어있는 인수가 data, 4개의 구간으로 나누고, 각 구간의 이름을 labels의 레이블을 사용하겠다. 
cats

['Q4', 'Q3', 'Q4', 'Q4', 'Q4', ..., 'Q3', 'Q2', 'Q3', 'Q1', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [252]:
pd.value_counts(cats)

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_2212\1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

Q1    250
Q2    250
Q3    250
Q4    250
Name: count, dtype: int64

In [254]:
np.random.seed(0)
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [256]:
#3 groupby 명령을 사용하여 그룹 A와 그룹 B로 구분한 그룹 데이터를 만듬
groups = df2.groupby(df2.key1)
groups

In [258]:
# 각 그룹 데이터의 인덱스를 저장한 groups 속성 확인
groups.groups

{'A': [0, 1, 4], 'B': [2, 3]}

In [260]:
# A그룹과 B그룹 데이터의 합계
# groups.sum()
groups.sum(numeric_only= True)

      data1  data2
key1
A         8     80
B         7     70

In [262]:
# 데이터를 그룹으로 나눈 GroupBy 클래스 객체 또는 그룹분석한 결과에서 data1만 뽑기
df2.groupby(df2.key1)["data1"].sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [264]:
df2.groupby(df2.key1).sum()["data1"]  
# 전체 데이터를 분석한 후 data1만 선택한 경우

key1
A    8
B    7
Name: data1, dtype: int64